app/Models/Backend/ShopCurrency.php

    public static function setCode($code)
    {
        self::$code = $code;
        if (empty(self::$checkListCurrency[$code])) {
            self::$checkListCurrency[$code] = self::where('code', $code)->first();
---
select * from `shop_currencies` where `code` = 'VNĐ' limit 1