app/Http/Controllers/PageController.php

select * from `pages` where `slug` = 'home' limit 1
select * from `categories` where `status` = 1 and `type` = 'product' and `parent` = 0 order by `sort` asc
select * from `products` order by `id` desc limit 5
select `id`, `name`, `slug`, `sort`, `parent`, `status`, `hot` from `categories` where (`status` = 1 and `type` = 'product' and `hot` = 1) and `parent` = 0 order by `sort` desc
select `id`, `slug`, `name`, `image`, `description`, `created_at` from `posts` where `status` = 1 order by `sort` desc limit 3
---
    public function index()
    {
        $this->localized();
        $page = Page::where('slug', 'home')->first();
        $this->data['page'] = $page;
        // $this->data['news'] = \App\News::with('category')
        //     ->whereHas('category', function ($query) {
        //         return $query->where('id', 1);
        //     })
        //     ->where('status', 1)->orderbyDesc('id')->limit(4)->get();

        // MAIN MENU
        // $categories = Menu::getByName('Menu-main');
        // $this->data['categories'] = Category::where('status', 1)->where('parent', 0)->orderby('sort', 'DESC')->limit(4)->get();

        $this->data['categories'] = Category::where('status', 1)
            ->where('parent', 0)
            ->orderby('sort', 'asc')
            ->get();

        $this->data['products'] = Product::orderbyDesc('id')->limit(5)->get();

        $homeCategories = Category::where([
            'status' => 1,
            'hot' => 1,
        ])
            ->where('parent', 0)
            ->orderByDesc('sort')
            ->with(['products' => function ($query) {
                $query->where('status', 1)
                    ->select(
                        'products.id',
                        'products.name',
                        'products.slug',
                        'products.image',
                        'products.price',
                        'products.price_type',
                        'products.sort'
                    );
            }])
            ->get(['id', 'name', 'slug', 'sort', 'parent', 'status', 'hot']);

        $this->data['home_categories'] = $this->transformHomeCategories($homeCategories);

        $homeNews = Page::posts()->where('status', 1)
            ->orderByDesc('sort')
            ->limit(3)
            ->select('id', 'slug', 'name', 'image', 'description', 'created_at')
            ->get();