app/Http/Controllers/ProductController.php

    public function index($slug = '')
    {
        // All category
        $categories = Category::where(['status' => 1, 'parent' => 0])
            ->orderBy('sort', 'asc')
            ->with(['products' => function ($query) {
                $query->where('status', 1)
                    ->select(
                        'products.id',
                        'products.name',
                        'products.slug',
                        'products.image',
                        'products.price',
                        'products.price_type',
                        'products.sort'
                    );
            }])
            ->get(['id', 'name', 'slug', 'sort', 'parent', 'status']);

        // All news
        $news = Product::where('status', 1)
            ->orderbyDesc('sort')
            ->paginate(10);

        // Lastest news
        $feature_news = Product::where('status', 1)
            ->orderbyDesc('id')
            ->limit(1)
            ->get();
---
select `products`.`id`, `products`.`name`, `products`.`slug`, `products`.`image`, `products`.`price`, `products`.`price_type`, `products`.`sort`, `product_categories`.`category_id` as `pivot_category_id`, `product_categories`.`product_id` as `pivot_product_id` from `products` inner join `product_categories` on `products`.`id` = `product_categories`.`product_id` where `product_categories`.`category_id` in (5, 17, 21, 22) and `status` = 1
select `id`, `name`, `slug`, `sort`, `parent`, `status` from `categories` where (`status` = 1 and `type` = 'product' and `parent` = 0) order by `sort` asc
select * from `products` where `status` = 1 order by `sort` desc limit 10 offset 0
select count(*) as aggregate from `products` where `status` = 1
select * from `products` where `status` = 1 order by `id` desc limit 1

    public function categoryDetail($slug)
    {
        $category = Category::where('slug', $slug)->first();

        if ($category) {
            $this->data['category'] = $category;
            $this->data['category_child'] = $category->children();

            $this->data['product'] = $product = $category->products()
                ->where('status', 1)
                ->orderbyDesc('sort')->orderbyDesc('name')->orderbyDesc('id')
                ->paginate(12);
---
select * from `categories` where `slug` = 'bo-dat' limit 1
select `products`.*, `product_categories`.`category_id` as `pivot_category_id`, `product_categories`.`product_id` as `pivot_product_id` from `products` inner join `product_categories` on `products`.`id` = `product_categories`.`product_id` where `product_categories`.`category_id` = 15 and `status` = 1 order by `sort` desc, `name` desc, `id` desc limit 12 offset 0
select count(*) as aggregate from `products` inner join `product_categories` on `products`.`id` = `product_categories`.`product_id` where `product_categories`.`category_id` = 15 and `status` = 1

    public function productDetail($slug)
    {
        $product = Product::where('slug', $slug)->first();

        if (!$product) {
            return abort(404);
        }

        // All category
        $categories = Category::where(['status' => 1, 'parent' => 0])->get();

        // Related products (same category, exclude current)
        $related_products = collect();
        $primaryCategory = Category::whereHas('products', function ($query) use ($product) {
            $query->where('products.id', $product->id);
        })->first();

        if ($primaryCategory) {
            $related_products = $primaryCategory->products()
                ->where('status', 1)
                ->where('products.id', '<>', $product->id)
                ->orderByDesc('sort')
                ->orderByDesc('id')
                ->limit(4)
                ->get([
                    'products.id',
                    'products.name',
                    'products.slug',
                    'products.image',
                    'products.price',
                ]);
---
select * from `products` where `slug` = 'ngo-hat-lon-phap-vinh-nong-vk-44' limit 1
select * from `categories` where (`status` = 1 and `type` = 'product' and `parent` = 0)
select * from `categories` where exists (select * from `products` inner join `product_categories` on `products`.`id` = `product_categories`.`product_id` where `categories`.`id` = `product_categories`.`category_id` and `products`.`id` = 2) limit 1
select `products`.`id`, `products`.`name`, `products`.`slug`, `products`.`image`, `products`.`price`, `product_categories`.`category_id` as `pivot_category_id`, `product_categories`.`product_id` as `pivot_product_id` from `products` inner join `product_categories` on `products`.`id` = `product_categories`.`product_id` where `product_categories`.`category_id` = 5 and `status` = 1 and `products`.`id` <> 2 order by `sort` desc, `id` desc limit 4